In [ ]:
%load_ext sql

In [ ]:
!pip install SQLAlchemy==1.4.47

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting SQLAlchemy==1.4.47
  Downloading SQLAlchemy-1.4.47-cp310-cp310-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 32.0 MB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.47) (2.0.2)
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.10
    Uninstalling SQLAlchemy-2.0.10:
      Successfully uninstalled SQLAlchemy-2.0.10
Successfully installed SQLAlchemy-1.4.47

In [ ]:
%sql postgresql://admin:Qwer1234@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev

In [ ]:
%%sql
-- visitor_session 넣기


CREATE TABLE raw_data.visitor_session(
    session_id integer primary key,
    visit_dt timestamp,
    day_code varchar(10),
    tourist_cd varchar(10),
    tourist_nm integer,
    code_seq integer
)

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql
-- visitor_session 벌크업데이트

COPY raw_data.visitor_session
FROM 's3://tour-dashboard-4-2/csv_data/VISITOR_SESSION.csv'
credentials 'aws_iam_role=arn:aws:iam::433690009634:role/redshift.read.s3'
delimiter ',' dateformat 'auto' timeformat 'auto' IGNOREHEADER 1 removequotes;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

-- Test SELECT to visitor_session

SELECT *
FROM raw_data.visitor_session
LIMIT 10

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(27, datetime.datetime(2020, 4, 29, 0, 0), '3', '1', 111853, 44),
 (123, datetime.datetime(2020, 4, 29, 0, 0), '3', '1', 63770, 82),
 (289, datetime.datetime(2020, 4, 29, 0, 0), '3', '2', 193144, 118),
 (389, datetime.datetime(2020, 4, 29, 0, 0), '3', '3', 1, 152),
 (607, datetime.datetime(2020, 4, 29, 0, 0), '3', '2', 92474, 187),
 (769, datetime.datetime(2020, 4, 30, 0, 0), '4', '3', 30, 37),
 (826, datetime.datetime(2020, 4, 30, 0, 0), '4', '3', 32, 92),
 (863, datetime.datetime(2020, 4, 30, 0, 0), '4', '1', 66644, 90),
 (979, datetime.datetime(2020, 4, 30, 0, 0), '4', '3', 71, 122),
 (1006, datetime.datetime(2020, 4, 30, 0, 0), '4', '3', 474, 137)]

In [ ]:
%%sql
-- 범죄데이터 넣기, COPY

CREATE TABLE raw_data.crime_count(
    crime_id varchar(10),
    crime_category varchar(32),
    crime_detail varchar(32),
    occur_year integer,
    crime_count integer
)

In [ ]:
%%sql
-- 범죄데이터 벌크업데이트


COPY raw_data.crime_count
FROM 's3://sunho-test-bucket/tour_api/crime_count.csv'
CREDENTIALS 'aws_iam_role=arn:aws:iam::159380084045:role/redshift.read.s3'
delimiter ',' IGNOREHEADER 1 removequotes;

In [ ]:
%%sql

-- Dealing Error

SELECT * 
FROM sys_load_error_detail
ORDER BY start_time DESC;

 * postgresql://admin:***@default.159380084045.us-west-2.redshift-serverless.amazonaws.com:5439/dev
4 rows affected.

[(100, 2001310, 49670, 1073995895, 'dev', 159385, datetime.datetime(2023, 5, 30, 8, 39, 42, 787095), 's3://sunho-test-bucket/test-data/VISITOR_SESSION.csv                                                                                                                                                                                                            ', 2, 'visit_dt                                                                                                                       ', 'timestamp ', '0         ', 2, 1206, 'Invalid timestamp format or value [YYYY-MM-DD HH24:MI:SS]                                                                                             ... (214 characters truncated) ...                                                                                                                                                      '),
 (100, 2001273, 49605, 1073995895, 'dev', 159385, datetime.datetime(2023, 5, 30, 8, 38, 23, 981647), 's3://sunho-test-bucket/test-data/VISITOR_SESSION.csv                                                                                                                                                                                                            ', 2, 'visit_dt                                                                                                                       ', 'timestamp ', '0         ', 2, 1206, 'Invalid timestamp format or value [YYYY-MM-DD HH24:MI:SS]                                                                                             ... (214 characters truncated) ...                                                                                                                                                      '),
 (100, 2000877, 48694, 1073995895, 'dev', 159385, datetime.datetime(2023, 5, 30, 8, 20, 40, 161122), 's3://sunho-test-bucket/test-data/VISITOR_SESSION.csv                                                                                                                                                                                                            ', 2, 'visit_dt                                                                                                                       ', 'timestamp ', '0         ', 2, 1206, 'Invalid timestamp format or value [YYYY-MM-DD HH24:MI:SS]                                                                                             ... (214 characters truncated) ...                                                                                                                                                      '),
 (100, 2000815, 48562, 1073995895, 'dev', 159385, datetime.datetime(2023, 5, 30, 8, 18, 14, 567941), 's3://sunho-test-bucket/test-data/VISITOR_SESSION.csv                                                                                                                                                                                                            ', 2, 'visit_dt                                                                                                                       ', 'timestamp ', '0         ', 2, 1206, 'Invalid timestamp format or value [YYYY-MM-DD HH24:MI:SS]                                                                                             ... (214 characters truncated) ...                                                                                                                                                      ')]